In [13]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt
import numpy as np
import ast


dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])
df['job_skills'] = df['job_skills'].apply(lambda skills_list: ast.literal_eval(skills_list) if pd.notna(skills_list) else skills_list)

In [18]:
df_salary = df[pd.notna(df['salary_year_avg'])].copy()
df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(lambda salary: salary * 1.03)

In [19]:
df_salary[['salary_year_avg', 'salary_year_inflated']]

        salary_year_avg  salary_year_inflated
28             109500.0             112785.00
77             140000.0             144200.00
92             120000.0             123600.00
100            228222.0             235068.66
109             89000.0              91670.00
...                 ...                   ...
785624         139216.0             143392.48
785641         150000.0             154500.00
785648         221875.0             228531.25
785682         157500.0             162225.00
785692         157500.0             162225.00

[22003 rows x 2 columns]

In [20]:
def projected_salary(row):
    if 'Senior' in row['job_title_short']:
        return row['salary_year_avg'] * 1.05
    else:
        return row['salary_year_avg'] * 1.03

df_salary['salary_year_inflated'] = df_salary.apply(projected_salary, axis=1)

In [21]:
df_salary[['job_title_short', 'salary_year_avg', 'salary_year_inflated']].sample(20)

             job_title_short  salary_year_avg  salary_year_inflated
501111          Data Analyst         169686.0             174776.58
437186     Software Engineer         111500.0             114845.00
610314         Data Engineer         140000.0             144200.00
542035          Data Analyst          75000.0              77250.00
277692        Data Scientist         100000.0             103000.00
518239        Data Scientist         233500.0             240505.00
76651          Data Engineer         156000.0             160680.00
552551          Data Analyst          49500.0              50985.00
31002           Data Analyst         115000.0             118450.00
748367         Data Engineer         155000.0             159650.00
138846        Data Scientist         375000.0             386250.00
723913  Senior Data Engineer          98283.0             103197.15
345103          Data Analyst          45000.0              46350.00
9903    Senior Data Engineer         147500.0             154875.00
161842        Data Scientist          78300.0              80649.00
412040        Data Scientist          90000.0              92700.00
624219         Data Engineer          90000.0              92700.00
306693        Data Scientist         265500.0             273465.00
516458          Data Analyst          79200.0              81576.00
428192          Data Analyst         100500.0             103515.00